Revit 2026 API

# TransferringProjectStandardsEventArgsSetExternalItems Method

---
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetExternalItems(
	IDictionary<Guid, string> externalItems
)
```
```vb
Public Sub SetExternalItems (
	externalItems As IDictionary(Of Guid, String)
)
```
```cpp
public:
void SetExternalItems(
	IDictionary<Guid, String^>^ externalItems
)
```
```fsharp
member SetExternalItems :
        externalItems : IDictionary<Guid, string> -> unit
```

#### Parameters

externalItems IDictionaryGuid, String

#### Reference

TransferringProjectStandardsEventArgs Class

Autodesk.Revit.UI.Events Namespace